Tekla.Structures.DirectManipulation.Adapter.Controls.DimensionInputWindow
The Tekla.Structures.DirectManipulation.Adapter.Controls.DimensionInputWindow class provides a window to get the user input dimension.

Tekla.Structures.DirectManipulation.Adapter.Controls.DimensionInputWindow.Instance
The instance.

Tekla.Structures.DirectManipulation.Adapter.Controls.DimensionInputWindow.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.DimensionInputWindow class.

Tekla.Structures.DirectManipulation.Adapter.Controls.DimensionInputWindow.Arrows
Gets the arrows container.

Tekla.Structures.DirectManipulation.Adapter.Controls.DimensionInputWindow.RequestDimension(Tekla.BIM.DirectManipulation.Services.Interaction.DimensionInput,System.Windows.Point,System.Windows.Point,Tekla.BIM.DirectManipulation.Services.Manipulators.DimensionInputDirection)
Requests the dimension input.
initialValue: The initial value.
negativeEnd: The negative end.
positiveEnd: The positive end.
visibleInputDirection: The visible input direction.
Returns:
The dimension input, if any.

Tekla.Structures.DirectManipulation.Adapter.Controls.DimensionInputWindow.OnElementHit(System.Windows.DependencyObject)
Called when the element is hit.
target: The hit element visual hit.